# Indexing & Selection & Filtering in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])

In [3]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [4]:
obj["c"]

2

In [5]:
obj[2]

2

In [6]:
obj[0:3]

a    0
b    1
c    2
dtype: int32

In [7]:
obj[["a","c"]]

a    0
c    2
dtype: int32

In [8]:
obj[[0,2]]

a    0
c    2
dtype: int32

In [9]:
obj[obj<2]

a    0
b    1
dtype: int32

In [10]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int32

In [11]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

## DataFrame Indexing

In [18]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["Delhi","Mumbai",
           "Banglore","Hyderabad"],
    columns=["one","two","three","four"])
data

           one  two  three  four
Delhi        0    1      2     3
Mumbai       4    5      6     7
Banglore     8    9     10    11
Hyderabad   12   13     14    15

In [19]:
data["two"]

Delhi         1
Mumbai        5
Banglore      9
Hyderabad    13
Name: two, dtype: int32

In [20]:
data[["one","two"]]

           one  two
Delhi        0    1
Mumbai       4    5
Banglore     8    9
Hyderabad   12   13

In [23]:
data[:3]

          one  two  three  four
Delhi       0    1      2     3
Mumbai      4    5      6     7
Banglore    8    9     10    11

In [24]:
data[data["four"]>5]

           one  two  three  four
Mumbai       4    5      6     7
Banglore     8    9     10    11
Hyderabad   12   13     14    15

In [25]:
data[data<5]=0
data

           one  two  three  four
Delhi        0    0      0     0
Mumbai       0    5      6     7
Banglore     8    9     10    11
Hyderabad   12   13     14    15

## Selecting with iloc and loc

In [26]:
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Mumbai, dtype: int32

In [27]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Mumbai, dtype: int32

In [28]:
data.iloc[[1,3],[1,2,3]]

           two  three  four
Mumbai       5      6     7
Hyderabad   13     14    15

In [30]:
data.loc["Mumbai",["one","two"]]

one    0
two    5
Name: Mumbai, dtype: int32

In [31]:
data.loc[:"Mumbai","four"]

Delhi     0
Mumbai    7
Name: four, dtype: int32

In [33]:
toy_data=pd.Series(np.arange(5),
                   index=["a","b","c",
                          "d","e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [34]:
toy_data[-1]

4